{"keras_version": "1.2.1", "config": [{"config": {"output_shape_type": "raw", "input_dtype": "float32", "output_shape": null, "batch_input_shape": [null, 160, 320, 3], "name": "lambda_1", "arguments": {}, "trainable": true, "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>w\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}, "class_name": "Lambda"}, {"config": {"cropping": [[70, 25], [0, 0]], "trainable": true, "name": "cropping2d_1"}, "class_name": "Cropping2D"}, {"config": {"W_constraint": null, "nb_col": 5, "activation": "relu", "dim_ordering": "tf", "trainable": true, "b_constraint": null, "nb_row": 5, "nb_filter": 16, "border_mode": "same", "W_regularizer": null, "bias": true, "subsample": [2, 2], "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_1"}, "class_name": "Convolution2D"}, {"config": {"W_constraint": null, "nb_col": 5, "activation": "relu", "dim_ordering": "tf", "trainable": true, "b_constraint": null, "nb_row": 5, "nb_filter": 32, "border_mode": "same", "W_regularizer": null, "bias": true, "subsample": [2, 2], "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_2"}, "class_name": "Convolution2D"}, {"config": {"W_constraint": null, "nb_col": 3, "activation": "relu", "dim_ordering": "tf", "trainable": true, "b_constraint": null, "nb_row": 3, "nb_filter": 64, "border_mode": "same", "W_regularizer": null, "bias": true, "subsample": [2, 2], "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_3"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "name": "dense_1", "activation": "relu", "trainable": true, "b_constraint": null, "output_dim": 512, "W_regularizer": null, "bias": true, "input_dim": 23040, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.2}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "name": "dense_2", "activation": "relu", "trainable": true, "b_constraint": null, "output_dim": 100, "W_regularizer": null, "bias": true, "input_dim": 512, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"W_constraint": null, "name": "dense_3", "activation": "relu", "trainable": true, "b_constraint": null, "output_dim": 20, "W_regularizer": null, "bias": true, "input_dim": 100, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"W_constraint": null, "name": "dense_4", "activation": "linear", "trainable": true, "b_constraint": null, "output_dim": 1, "W_regularizer": null, "bias": true, "input_dim": 20, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}